package jp.ac.uryukyu.ie.e185722;

public class NumerOn {
    public void start(){
        //各変数の初期化。↓
        /*必要な変数
         * タイトル(String)、ルール文(String)、答え(int)の格納される配列。
         * プレイヤーが入力した数字(int)の格納される配列。
         * イート数(int)、バイト数(int)、チャレンジ(count)の回数
         */


        //タイトルとルールの表示


        //メソッド１
        //ランダムな答えを作成。(ヌメロンのルール上数字が被ってはいけない)


        //メソッド２
        //入力させる。
        //数値のチェックを行う。


        //メソッド３
        //答え判断


        //メソッド４
        //終了判断(ヒットが3つになったら終了)
    }
}
